# два варианта вывода HTML
# 1. (39:50)

from flask import Flask

app = Flask(__name__)

html = """
<h1>Привет, меня зовут Алексей</h1>
<p>Уже много лет я создаю сайты на Flask.<br/>Посмотрите на мой сайт.</p>
"""
@app.route('/')         # главная страница
def index():         
    return 'Привет, незнакомец!'

@app.route('/text/')
def text():
    return html # возврат заранее заданной переменной

# 2.
@app.route('/poems/')
def poems():
    poem = ['Вот не думал, не гадал,',
            'Программистом взял и стал.',
            'Хитрый знает он язык,',
            'Он к другому не привык.',
            ]
    txt = '<h1>Стихотворение</h1>\n<p>' + '<br/>'.join(poem) + '</p>'
    return txt # возврат переменной заданной внутри функции

if __name__ == "__main__":
    app.run(debug=True)